# GroupBy

In [1]:
import pandas as pd

In [2]:
var = pd.DataFrame({
    "name" : ["A","B","C","D","A","A","A","B","B","B","D","C"],
        "s_1" :[12,15,16,19,24,34,45,32,34,31,21,11],
        "s_2" :[24,32,45,15,25,35,11,22,33,31,32,41]
})

var

   name  s_1  s_2
0     A   12   24
1     B   15   32
2     C   16   45
3     D   19   15
4     A   24   25
5     A   34   35
6     A   45   11
7     B   32   22
8     B   34   33
9     B   31   31
10    D   21   32
11    C   11   41

In [5]:
var_1 = var.groupby("name")

var_1

In [9]:
#printing the GroupBy Data

for x,y in var_1:
    print(x)
    print(y)
    print()

A
  name  s_1  s_2
0    A   12   24
4    A   24   25
5    A   34   35
6    A   45   11

B
  name  s_1  s_2
1    B   15   32
7    B   32   22
8    B   34   33
9    B   31   31

C
   name  s_1  s_2
2     C   16   45
11    C   11   41

D
   name  s_1  s_2
3     D   19   15
10    D   21   32

In [11]:
#getting the Grouped Data of A
var_1.get_group("A")

  name  s_1  s_2
0    A   12   24
4    A   24   25
5    A   34   35
6    A   45   11

In [13]:
#minimum Operation
var_1.min()

      s_1  s_2
name
A      12   11
B      15   22
C      11   41
D      19   15

In [14]:
#maximum Operation
var_1.max()

      s_1  s_2
name
A      45   35
B      34   33
C      16   45
D      21   32

In [15]:
#mean Operation
var_1.mean()

        s_1    s_2
name
A     28.75  23.75
B     28.00  29.50
C     13.50  43.00
D     20.00  23.50

In [16]:
li = list(var_1)
li

[('A',
    name  s_1  s_2
  0    A   12   24
  4    A   24   25
  5    A   34   35
  6    A   45   11),
 ('B',
    name  s_1  s_2
  1    B   15   32
  7    B   32   22
  8    B   34   33
  9    B   31   31),
 ('C',
     name  s_1  s_2
  2     C   16   45
  11    C   11   41),
 ('D',
     name  s_1  s_2
  3     D   19   15
  10    D   21   32)]